content/Emacs.org
[[file:index.org][Back to main site]]
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+title: My Emacs configuration
* start by setting the initial font
#+begin_src emacs-lisp :tangle ./init.el
(set-face-attribute 'default nil :font "Fira Code Retina" :height efs/default-font-size)

;; Set the fixed pitch face
(set-face-attribute 'fixed-pitch nil :font "Fira Code Retina" :height efs/default-font-size)

;; Set the variable pitch face
(set-face-attribute 'variable-pitch nil :font "Cantarell" :height efs/default-variable-font-size :weight 'regular)
#+end_src
* Manage the package setup
#+begin_src emacs-lisp :tangle ./init.el
  (require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))


  ;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

* Key Bindings
My custom keybindings:
#+begin_src emacs-lisp :tangle ./init.el
  ;; toggle line numbers
  (global-set-key "\C-x\l" 'display-line-numbers-mode)
  (setq display-line-numbers-type 'relative)
  ;; start shell
  (global-set-key "\C-z" 'eshell)
  ;; Select window with ace-window
  (use-package ace-window
    :ensure ace-window
    :config (setq aw-keys '(?a ?c ?e ?u ?e ?d ?h ?t ?n ?s))
    :bind ("C-x o" . ace-window))
  ;reduce keystrokes replying
  (fset 'yes-or-no-p 'y-or-n-p)
  (setenv "HOME" "/home/kim/")
#+end_src
* Window movements with ace window
#+BEGIN_SRC emacs-lisp :tangle ./init.el
(use-package ace-window
  :ensure t
  :init
  (progn
    (global-set-key [remap other-window] 'ace-window)
    (custom-set-faces
     '(aw-leading-char-face
       ((t (:inherit ace-jumb-face-foreground :height 3.0)))))
    ))
 #+END_SRC
* Font rational
#+begin_src emacs-lisp :tangle ./init.el
    (custom-set-variables
     '(rational-ui-default-font
       '(:font "JetBrains Mono" :weight light :height 185)))

#+end_src

* Doom Theme
#+begin_src emacs-lisp :tangle ./init.el
(use-package doom-themes
  :init (load-theme 'doom-palenight t))
#+end_src
* Doom Modeline setup
#+begin_src emacs-lisp :tangle ./init.el
    (use-package all-the-icons
      :ensure t)

  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 25)))
  (setq doom-modeline-major-mode-icon t)
  (setq doom-modeline-major-mode-color-icon t)
#+end_src

