public/Emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Emacs configuration</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">My Emacs configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc06f65a">start by setting the initial font</a></li>
<li><a href="#org1803c76">Manage the package setup</a></li>
<li><a href="#org02c5563">Key Bindings</a></li>
<li><a href="#org71a5d21">Window movements with ace window</a></li>
<li><a href="#org0509825">Font rational</a></li>
<li><a href="#org17e1030">Doom Theme</a></li>
<li><a href="#org79c0928">Doom Modeline setup</a></li>
<li><a href="#org017579a">Dired configuration</a></li>
<li><a href="#org5cc313b">Org Mode Better Font Faces</a></li>
<li><a href="#org93cd8e3">Org Bullets</a></li>
<li><a href="#orgd15765c">Org Mode Basic Config</a></li>
<li><a href="#org608e72e">Org Roam - notes</a></li>
<li><a href="#orge48223d">Structure Templates</a></li>
<li><a href="#orgf5fa991">Babel tangle this configuration</a></li>
<li><a href="#org5f3cdec">Which Key</a></li>
<li><a href="#orgca5765f">Counsel &amp; Ivy</a></li>
<li><a href="#orgeb13655">Helm sorting and completion</a></li>
<li><a href="#orgfc1427e">Let's get encrypted</a></li>
<li><a href="#orge7d8894">Autocomplete</a></li>
<li><a href="#org850ac84">Magit</a></li>
<li><a href="#org4dbb338">Rainbow Delimiters</a></li>
<li><a href="#org378469e">EMMS Emacs music player</a></li>
<li><a href="#orga779402">Erc Chat</a></li>
<li><a href="#org6d75909">App launcher</a></li>
<li><a href="#orgb239536">Loading libraries</a></li>
<li><a href="#org70ab9c5">Reveal.js</a></li>
</ul>
</div>
</div>
<p>
<a href="index.html">Back to main site</a>
</p>
<div id="outline-container-orgc06f65a" class="outline-2">
<h2 id="orgc06f65a">start by setting the initial font</h2>
<div class="outline-text-2" id="text-orgc06f65a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-face-attribute 'default nil <span style="font-weight: bold;">:font</span> <span style="font-style: italic;">"Fira Code Retina"</span> <span style="font-weight: bold;">:height</span> efs/default-font-size)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set the fixed pitch face</span>
(set-face-attribute 'fixed-pitch nil <span style="font-weight: bold;">:font</span> <span style="font-style: italic;">"Fira Code Retina"</span> <span style="font-weight: bold;">:height</span> efs/default-font-size)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set the variable pitch face</span>
(set-face-attribute 'variable-pitch nil <span style="font-weight: bold;">:font</span> <span style="font-style: italic;">"Cantarell"</span> <span style="font-weight: bold;">:height</span> efs/default-variable-font-size <span style="font-weight: bold;">:weight</span> 'regular)
</pre>
</div>
</div>
</div>
<div id="outline-container-org1803c76" class="outline-2">
<h2 id="org1803c76">Manage the package setup</h2>
<div class="outline-text-2" id="text-org1803c76">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">package</span>)

(<span style="font-weight: bold;">setq</span> package-archives '((<span style="font-style: italic;">"melpa"</span> . <span style="font-style: italic;">"https://melpa.org/packages/"</span>)
                         (<span style="font-style: italic;">"org"</span> . <span style="font-style: italic;">"https://orgmode.org/elpa/"</span>)
                         (<span style="font-style: italic;">"elpa"</span> . <span style="font-style: italic;">"https://elpa.gnu.org/packages/"</span>)))


  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Initialize use-package on non-Linux platforms</span>
(<span style="font-weight: bold;">unless</span> (package-installed-p 'use-package)
  (package-install 'use-package))

(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">use-package</span>)
(<span style="font-weight: bold;">setq</span> use-package-always-ensure t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org02c5563" class="outline-2">
<h2 id="org02c5563">Key Bindings</h2>
<div class="outline-text-2" id="text-org02c5563">
<p>
My custom keybindings:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">toggle line numbers</span>
(global-set-key <span style="font-style: italic;">"\C-x</span><span style="font-weight: bold; font-style: italic;">\</span><span style="font-style: italic;">l"</span> 'display-line-numbers-mode)
(<span style="font-weight: bold;">setq</span> display-line-numbers-type 'relative)
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">start shell</span>
(global-set-key <span style="font-style: italic;">"\C-z"</span> 'eshell)
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Select window with ace-window</span>
(use-package ace-window
  <span style="font-weight: bold;">:ensure</span> ace-window
  <span style="font-weight: bold;">:config</span> (<span style="font-weight: bold;">setq</span> aw-keys '(?a ?c ?e ?u ?e ?d ?h ?t ?n ?s))
  <span style="font-weight: bold;">:bind</span> (<span style="font-style: italic;">"C-x o"</span> . ace-window))
<span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">reduce keystrokes replying</span>
(fset 'yes-or-no-p 'y-or-n-p)
(setenv <span style="font-style: italic;">"HOME"</span> <span style="font-style: italic;">"/home/kim/"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org71a5d21" class="outline-2">
<h2 id="org71a5d21">Window movements with ace window</h2>
<div class="outline-text-2" id="text-org71a5d21">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ace-window
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">progn</span>
    (global-set-key [remap other-window] 'ace-window)
    (custom-set-faces
     '(aw-leading-char-face
       ((t (<span style="font-weight: bold;">:inherit</span> ace-jumb-face-foreground <span style="font-weight: bold;">:height</span> 3.0)))))
    ))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0509825" class="outline-2">
<h2 id="org0509825">Font rational</h2>
<div class="outline-text-2" id="text-org0509825">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(custom-set-variables
 '(rational-ui-default-font
   '(<span style="font-weight: bold;">:font</span> <span style="font-style: italic;">"JetBrains Mono"</span> <span style="font-weight: bold;">:weight</span> light <span style="font-weight: bold;">:height</span> 185)))

</pre>
</div>
</div>
</div>

<div id="outline-container-org17e1030" class="outline-2">
<h2 id="org17e1030">Doom Theme</h2>
<div class="outline-text-2" id="text-org17e1030">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package doom-themes
  <span style="font-weight: bold;">:init</span> (load-theme 'doom-palenight t))
</pre>
</div>
</div>
</div>
<div id="outline-container-org79c0928" class="outline-2">
<h2 id="org79c0928">Doom Modeline setup</h2>
<div class="outline-text-2" id="text-org79c0928">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (use-package all-the-icons
    <span style="font-weight: bold;">:ensure</span> t)

(use-package doom-modeline
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span> (doom-modeline-mode 1)
  <span style="font-weight: bold;">:custom</span> ((doom-modeline-height 25)))
(<span style="font-weight: bold;">setq</span> doom-modeline-major-mode-icon t)
(<span style="font-weight: bold;">setq</span> doom-modeline-major-mode-color-icon t)
</pre>
</div>
</div>
</div>
