content/Emacs.org
* Dired configuration
Dired is a built-in file manager for Emacs that does some pretty amazing
things! Here are some key bindings you should try out:
Key Bindings
Navigation

Emacs / Evil

    n / j - next line
    p / k - previous line
    j / J - jump to file in buffer
    RET - select file or directory
    ^ - go to parent directory
    S-RET / g O - Open file in “other” window
    M-RET - Show file in other window without focusing (previewing files)
    g o (dired-view-file) - Open file but in a “preview” mode, close
    with q
    g / g r Refresh the buffer with revert-buffer after changing con-
    figuration (and after filesystem changes!)

Marking files

    m - Marks a file
    u - Unmarks a file
    U - Unmarks all files in buffer
    * t / t - Inverts marked files in buffer
    % m - Mark files in buffer using regular expression
    * - Lots of other auto-marking functions
    k / K - “Kill” marked items (refresh buffer with g / g r to get them
    back)
    Many operations can be done on a single file if there are no active
    marks!

Copying and Renaming files

    C - Copy marked files (or if no files are marked, the current file)
    Copying single and multiple files
    U - Unmark all files in buffer
    R - Rename marked files, renaming multiple is a move!
    % R - Rename based on regular expression: ^test , old-\&

Power command: C-x C-q (dired-toggle-read-only) - Makes all file names in
the buffer editable directly to rename them! Press Z Z to confirm renaming
or Z Q to abort.
Deleting files

    D - Delete marked file
    d - Mark file for deletion
    x - Execute deletion for marks
    delete-by-moving-to-trash - Move to trash instead of deleting per-
    manently

Creating and extracting archives

    Z - Compress or uncompress a file or folder to (.tar.gz)
    c - Compress selection to a specific file
    dired-compress-files-alist - Bind compression commands to file exten-
    sion

Other common operations

    T - Touch (change timestamp)
    M - Change file mode
    O - Change file owner
    G - Change file group
    S - Create a symbolic link to this file
    L - Load an Emacs Lisp file into Emacs

this is the Emacs filehandling and the filemanager
#+begin_src emacs-lisp :tangle ./init.el
  (use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  :custom ((dired-listing-switches "-agho --group-directories-first")))
(use-package dired-single)

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package dired-open
  :config
  ;; Doesn't work as expected!
  ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
  (setq dired-open-extensions '(("png" . "feh")
                                ("mkv" . "mpv")
				("mp3" . "mplayer"))))
#+end_src
* Org Mode Better Font Faces
The efs/org-font-setup function configures various text faces to
tweak the sizes of headings and use variable width fonts in most
cases so that it looks more like we’re editing a document in org-
mode. We switch back to fixed width (monospace) fonts for code
blocks and tables so that they display correctly.
#+begin_src emacs-lisp :tangle ./init.el
  (defun efs/org-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
  (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
  (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))
#+end_src

