public/Emacs.html

<div id="outline-container-org017579a" class="outline-2">
<h2 id="org017579a">Dired configuration</h2>
<div class="outline-text-2" id="text-org017579a">
<p>
Dired is a built-in file manager for Emacs that does some pretty amazing
things! Here are some key bindings you should try out:
Key Bindings
Navigation
</p>

<p>
Emacs / Evil
</p>

<p>
n / j - next line
p / k - previous line
j / J - jump to file in buffer
RET - select file or directory
^ - go to parent directory
S-RET / g O - Open file in “other” window
M-RET - Show file in other window without focusing (previewing files)
g o (dired-view-file) - Open file but in a “preview” mode, close
with q
g / g r Refresh the buffer with revert-buffer after changing con-
figuration (and after filesystem changes!)
</p>

<p>
Marking files
</p>

<p>
m - Marks a file
u - Unmarks a file
U - Unmarks all files in buffer
</p>
<ul class="org-ul">
<li>t / t - Inverts marked files in buffer</li>
</ul>
<p>
% m - Mark files in buffer using regular expression
</p>
<ul class="org-ul">
<li>- Lots of other auto-marking functions</li>
</ul>
<p>
k / K - “Kill” marked items (refresh buffer with g / g r to get them
back)
Many operations can be done on a single file if there are no active
marks!
</p>

<p>
Copying and Renaming files
</p>

<p>
C - Copy marked files (or if no files are marked, the current file)
Copying single and multiple files
U - Unmark all files in buffer
R - Rename marked files, renaming multiple is a move!
% R - Rename based on regular expression: ^test , old-\&amp;
</p>

<p>
Power command: C-x C-q (dired-toggle-read-only) - Makes all file names in
the buffer editable directly to rename them! Press Z Z to confirm renaming
or Z Q to abort.
Deleting files
</p>

<p>
D - Delete marked file
d - Mark file for deletion
x - Execute deletion for marks
delete-by-moving-to-trash - Move to trash instead of deleting per-
manently
</p>

<p>
Creating and extracting archives
</p>

<p>
Z - Compress or uncompress a file or folder to (.tar.gz)
c - Compress selection to a specific file
dired-compress-files-alist - Bind compression commands to file exten-
sion
</p>

<p>
Other common operations
</p>

<p>
T - Touch (change timestamp)
M - Change file mode
O - Change file owner
G - Change file group
S - Create a symbolic link to this file
L - Load an Emacs Lisp file into Emacs
</p>

<p>
this is the Emacs filehandling and the filemanager
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (use-package dired
  <span style="font-weight: bold;">:ensure</span> nil
  <span style="font-weight: bold;">:commands</span> (dired dired-jump)
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-x C-j"</span> . dired-jump))
  <span style="font-weight: bold;">:custom</span> ((dired-listing-switches <span style="font-style: italic;">"-agho --group-directories-first"</span>)))
(use-package dired-single)

(use-package all-the-icons-dired
  <span style="font-weight: bold;">:hook</span> (dired-mode . all-the-icons-dired-mode))

(use-package dired-open
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Doesn't work as expected!</span>
  <span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(add-to-list 'dired-open-functions #'dired-open-xdg t)</span>
  (<span style="font-weight: bold;">setq</span> dired-open-extensions '((<span style="font-style: italic;">"png"</span> . <span style="font-style: italic;">"feh"</span>)
                                (<span style="font-style: italic;">"mkv"</span> . <span style="font-style: italic;">"mpv"</span>)
                                (<span style="font-style: italic;">"mp3"</span> . <span style="font-style: italic;">"mplayer"</span>))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5cc313b" class="outline-2">
<h2 id="org5cc313b">Org Mode Better Font Faces</h2>
<div class="outline-text-2" id="text-org5cc313b">
<p>
The efs/org-font-setup function configures various text faces to
tweak the sizes of headings and use variable width fonts in most
cases so that it looks more like we’re editing a document in org-
mode. We switch back to fixed width (monospace) fonts for code
blocks and tables so that they display correctly.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">efs/org-font-setup</span> ()
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Replace list hyphen with dot</span>
(font-lock-add-keywords 'org-mode
                        '((<span style="font-style: italic;">"^ *</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">[-]</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;"> "</span>
                           (0 (<span style="font-weight: bold;">prog1</span> () (compose-region (match-beginning 1) (match-end 1) <span style="font-style: italic;">"&#8226;"</span>))))))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set faces for heading levels</span>
(<span style="font-weight: bold;">dolist</span> (face '((org-level-1 . 1.2)
                (org-level-2 . 1.1)
                (org-level-3 . 1.05)
                (org-level-4 . 1.0)
                (org-level-5 . 1.1)
                (org-level-6 . 1.1)
                (org-level-7 . 1.1)
                (org-level-8 . 1.1)))
  (set-face-attribute (car face) nil <span style="font-weight: bold;">:font</span> <span style="font-style: italic;">"Cantarell"</span> <span style="font-weight: bold;">:weight</span> 'regular <span style="font-weight: bold;">:height</span> (cdr face)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ensure that anything that should be fixed-pitch in Org files appears that way</span>
(set-face-attribute 'org-block nil    <span style="font-weight: bold;">:foreground</span> nil <span style="font-weight: bold;">:inherit</span> 'fixed-pitch)
(set-face-attribute 'org-table nil    <span style="font-weight: bold;">:inherit</span> 'fixed-pitch)
(set-face-attribute 'org-formula nil  <span style="font-weight: bold;">:inherit</span> 'fixed-pitch)
(set-face-attribute 'org-code nil     <span style="font-weight: bold;">:inherit</span> '(shadow fixed-pitch))
(set-face-attribute 'org-table nil    <span style="font-weight: bold;">:inherit</span> '(shadow fixed-pitch))
(set-face-attribute 'org-verbatim nil <span style="font-weight: bold;">:inherit</span> '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil <span style="font-weight: bold;">:inherit</span> '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil <span style="font-weight: bold;">:inherit</span> '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil  <span style="font-weight: bold;">:inherit</span> 'fixed-pitch)
(set-face-attribute 'line-number nil <span style="font-weight: bold;">:inherit</span> 'fixed-pitch)
(set-face-attribute 'line-number-current-line nil <span style="font-weight: bold;">:inherit</span> 'fixed-pitch))
</pre>
</div>
</div>
</div>
