public/Emacs.html

<div id="outline-container-org93cd8e3" class="outline-2">
<h2 id="org93cd8e3">Org Bullets</h2>
<div class="outline-text-2" id="text-org93cd8e3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">efs/org-mode-setup</span> ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))

  (<span style="font-weight: bold;">setq</span> org-ellipsis <span style="font-style: italic;">" &#9662;"</span>)

(use-package org-bullets
  <span style="font-weight: bold;">:hook</span> (org-mode . org-bullets-mode)
  <span style="font-weight: bold;">:custom</span>
  (org-bullets-bullet-list '(<span style="font-style: italic;">"&#9673;"</span> <span style="font-style: italic;">"&#9675;"</span> <span style="font-style: italic;">"&#9679;"</span> <span style="font-style: italic;">"&#9675;"</span> <span style="font-style: italic;">"&#9679;"</span> <span style="font-style: italic;">"&#9675;"</span> <span style="font-style: italic;">"&#9679;"</span>)))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">efs/org-mode-visual-fill</span> ()
  (<span style="font-weight: bold;">setq</span> visual-fill-column-width 80
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  <span style="font-weight: bold;">:hook</span> (org-mode . efs/org-mode-visual-fill))

 (<span style="font-weight: bold;">setq</span> org-latex-pdf-process
          '(<span style="font-style: italic;">"latexmk -pdflatex='pdflatex -interaction nonstopmode' -pdf -bibtex -f %f"</span>))

(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">org-tempo</span>)


(<span style="font-weight: bold;">unless</span> (boundp 'org-latex-classes)
  (<span style="font-weight: bold;">setq</span> org-latex-classes nil))

    (add-to-list 'org-latex-classes
                 '(<span style="font-style: italic;">"ethz"</span>
                   <span style="font-style: italic;">"\\documentclass[a4paper,11pt,titlepage]{memoir}</span>
<span style="font-style: italic;">    \\usepackage[utf8]{inputenc}</span>
<span style="font-style: italic;">    \\usepackage[T1]{fontenc}</span>
<span style="font-style: italic;">    \\usepackage{fixltx2e}</span>
<span style="font-style: italic;">    \\usepackage{graphicx}</span>
<span style="font-style: italic;">    \\usepackage{longtable}</span>
<span style="font-style: italic;">    \\usepackage{float}</span>
<span style="font-style: italic;">    \\usepackage{wrapfig}</span>
<span style="font-style: italic;">    \\usepackage{rotating}</span>
<span style="font-style: italic;">    \\usepackage[normalem]{ulem}</span>
<span style="font-style: italic;">    \\usepackage{amsmath}</span>
<span style="font-style: italic;">    \\usepackage{textcomp}</span>
<span style="font-style: italic;">    \\usepackage{marvosym}</span>
<span style="font-style: italic;">    \\usepackage{wasysym}</span>
<span style="font-style: italic;">    \\usepackage{amssymb}</span>
<span style="font-style: italic;">    \\usepackage{hyperref}</span>
<span style="font-style: italic;">    \\usepackage{mathpazo}</span>
<span style="font-style: italic;">    \\usepackage{color}</span>
<span style="font-style: italic;">    \\usepackage{enumerate}</span>
<span style="font-style: italic;">    \\definecolor{bg}{rgb}{0.95,0.95,0.95}</span>
<span style="font-style: italic;">    \\tolerance=1000</span>
<span style="font-style: italic;">          [NO-DEFAULT-PACKAGES]</span>
<span style="font-style: italic;">          [PACKAGES]</span>
<span style="font-style: italic;">          [EXTRA]</span>
<span style="font-style: italic;">    \\linespread{1.1}</span>
<span style="font-style: italic;">    \\hypersetup{pdfborder=0 0 0}"</span>
                   (<span style="font-style: italic;">"\\chapter{%s}"</span> . <span style="font-style: italic;">"\\chapter*{%s}"</span>)
                   (<span style="font-style: italic;">"\\section{%s}"</span> . <span style="font-style: italic;">"\\section*{%s}"</span>)
                   (<span style="font-style: italic;">"\\subsection{%s}"</span> . <span style="font-style: italic;">"\\subsection*{%s}"</span>)
                   (<span style="font-style: italic;">"\\subsubsection{%s}"</span> . <span style="font-style: italic;">"\\subsubsection*{%s}"</span>)
                   (<span style="font-style: italic;">"\\paragraph{%s}"</span> . <span style="font-style: italic;">"\\paragraph*{%s}"</span>)
                   (<span style="font-style: italic;">"\\subparagraph{%s}"</span> . <span style="font-style: italic;">"\\subparagraph*{%s}"</span>)))


    (add-to-list 'org-latex-classes
                 '(<span style="font-style: italic;">"article"</span>
                   <span style="font-style: italic;">"\\documentclass[11pt,a4paper]{article}</span>
<span style="font-style: italic;">    \\usepackage[utf8]{inputenc}</span>
<span style="font-style: italic;">    \\usepackage[T1]{fontenc}</span>
<span style="font-style: italic;">    \\usepackage{fixltx2e}</span>
<span style="font-style: italic;">    \\usepackage{graphicx}</span>
<span style="font-style: italic;">    \\usepackage{longtable}</span>
<span style="font-style: italic;">    \\usepackage{float}</span>
<span style="font-style: italic;">    \\usepackage{wrapfig}</span>
<span style="font-style: italic;">    \\usepackage{rotating}</span>
<span style="font-style: italic;">    \\usepackage[normalem]{ulem}</span>
<span style="font-style: italic;">    \\usepackage{amsmath}</span>
<span style="font-style: italic;">    \\usepackage{textcomp}</span>
<span style="font-style: italic;">    \\usepackage{marvosym}</span>
<span style="font-style: italic;">    \\usepackage{wasysym}</span>
<span style="font-style: italic;">    \\usepackage{amssymb}</span>
<span style="font-style: italic;">    \\usepackage{hyperref}</span>
<span style="font-style: italic;">    \\usepackage{mathpazo}</span>
<span style="font-style: italic;">    \\usepackage{color}</span>
<span style="font-style: italic;">    \\usepackage{enumerate}</span>
<span style="font-style: italic;">    \\definecolor{bg}{rgb}{0.95,0.95,0.95}</span>
<span style="font-style: italic;">    \\tolerance=1000</span>
<span style="font-style: italic;">          [NO-DEFAULT-PACKAGES]</span>
<span style="font-style: italic;">          [PACKAGES]</span>
<span style="font-style: italic;">          [EXTRA]</span>
<span style="font-style: italic;">    \\linespread{1.1}</span>
<span style="font-style: italic;">    \\hypersetup{pdfborder=0 0 0}"</span>
                   (<span style="font-style: italic;">"\\section{%s}"</span> . <span style="font-style: italic;">"\\section*{%s}"</span>)
                   (<span style="font-style: italic;">"\\subsection{%s}"</span> . <span style="font-style: italic;">"\\subsection*{%s}"</span>)
                   (<span style="font-style: italic;">"\\subsubsection{%s}"</span> . <span style="font-style: italic;">"\\subsubsection*{%s}"</span>)
                   (<span style="font-style: italic;">"\\paragraph{%s}"</span> . <span style="font-style: italic;">"\\paragraph*{%s}"</span>)))


    (add-to-list 'org-latex-classes '(<span style="font-style: italic;">"ebook"</span>
                                      <span style="font-style: italic;">"\\documentclass[11pt, oneside]{memoir}</span>
<span style="font-style: italic;">    \\setstocksize{9in}{6in}</span>
<span style="font-style: italic;">    \\settrimmedsize{\\stockheight}{\\stockwidth}{*}</span>
<span style="font-style: italic;">    \\setlrmarginsandblock{2cm}{2cm}{*} % Left and right margin</span>
<span style="font-style: italic;">    \\setulmarginsandblock{2cm}{2cm}{*} % Upper and lower margin</span>
<span style="font-style: italic;">    \\checkandfixthelayout</span>
<span style="font-style: italic;">    % Much more laTeX code omitted</span>
<span style="font-style: italic;">    "</span>
                                      (<span style="font-style: italic;">"\\chapter{%s}"</span> . <span style="font-style: italic;">"\\chapter*{%s}"</span>)
                                      (<span style="font-style: italic;">"\\section{%s}"</span> . <span style="font-style: italic;">"\\section*{%s}"</span>)
                                      (<span style="font-style: italic;">"\\subsection{%s}"</span> .
<span style="font-style: italic;">"\\subsection*{%s}"</span>)))
</pre>
</div>
</div>
</div>
