public/Emacs.html

<div id="outline-container-orgd15765c" class="outline-2">
<h2 id="orgd15765c">Org Mode Basic Config</h2>
<div class="outline-text-2" id="text-orgd15765c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">efs/org-mode-setup</span> ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))

(use-package org
  <span style="font-weight: bold;">:pin</span> org
  <span style="font-weight: bold;">:commands</span> (org-capture org-agenda)
  <span style="font-weight: bold;">:hook</span> (org-mode . efs/org-mode-setup)
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> org-ellipsis <span style="font-style: italic;">" &#9662;"</span>)

  (<span style="font-weight: bold;">setq</span> org-agenda-start-with-log-mode t)
  (<span style="font-weight: bold;">setq</span> org-log-done 'time)
  (<span style="font-weight: bold;">setq</span> org-log-into-drawer t)

  (<span style="font-weight: bold;">setq</span> org-agenda-files
        '(<span style="font-style: italic;">"~/Projekter/Kode/OrgFiles/Opgaver.org"</span>
          <span style="font-style: italic;">"~/Projekter/Kode/OrgFiles/Vaner.org"</span>
          <span style="font-style: italic;">"~/Projekter/Kode/OrgFiles/F&#248;dselsdage.org"</span>))

  (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">org-habit</span>)
  (add-to-list 'org-modules 'org-habit)
  (<span style="font-weight: bold;">setq</span> org-habit-graph-column 60)

  (<span style="font-weight: bold;">setq</span> org-todo-keywords
    '((sequence <span style="font-style: italic;">"TODO(t)"</span> <span style="font-style: italic;">"NEXT(n)"</span> <span style="font-style: italic;">"|"</span> <span style="font-style: italic;">"DONE(d!)"</span>)
      (sequence <span style="font-style: italic;">"BACKLOG(b)"</span> <span style="font-style: italic;">"PLAN(p)"</span> <span style="font-style: italic;">"READY(r)"</span> <span style="font-style: italic;">"ACTIVE(a)"</span> <span style="font-style: italic;">"REVIEW(v)"</span> <span style="font-style: italic;">"WAIT(w@/!)"</span> <span style="font-style: italic;">"HOLD(h)"</span> <span style="font-style: italic;">"|"</span> <span style="font-style: italic;">"COMPLETED(c)"</span> <span style="font-style: italic;">"CANC(k@)"</span>)))

  (<span style="font-weight: bold;">setq</span> org-refile-targets
    '((<span style="font-style: italic;">"Archive.org"</span> <span style="font-weight: bold;">:maxlevel</span> . 1)
      (<span style="font-style: italic;">"Opgaver.org"</span> <span style="font-weight: bold;">:maxlevel</span> . 1)))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Save Org buffers after refiling!</span>
  (advice-add 'org-refile <span style="font-weight: bold;">:after</span> 'org-save-all-org-buffers)

  (<span style="font-weight: bold;">setq</span> org-tag-alist
    '((<span style="font-weight: bold;">:startgroup</span>)
       <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Put mutually exclusive tags here</span>
       (<span style="font-weight: bold;">:endgroup</span>)
       (<span style="font-style: italic;">"@errand"</span> . ?E)
       (<span style="font-style: italic;">"@home"</span> . ?H)
       (<span style="font-style: italic;">"@work"</span> . ?W)
       (<span style="font-style: italic;">"agenda"</span> . ?a)
       (<span style="font-style: italic;">"planning"</span> . ?p)
       (<span style="font-style: italic;">"publish"</span> . ?P)
       (<span style="font-style: italic;">"batch"</span> . ?b)
       (<span style="font-style: italic;">"note"</span> . ?n)
       (<span style="font-style: italic;">"idea"</span> . ?i)))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Configure custom agenda views</span>
  (<span style="font-weight: bold;">setq</span> org-agenda-custom-commands
   '((<span style="font-style: italic;">"d"</span> <span style="font-style: italic;">"Dashboard"</span>
     ((agenda <span style="font-style: italic;">""</span> ((org-deadline-warning-days 7)))
      (todo <span style="font-style: italic;">"NEXT"</span>
        ((org-agenda-overriding-header <span style="font-style: italic;">"Next Tasks"</span>)))
      (tags-todo <span style="font-style: italic;">"agenda/ACTIVE"</span> ((org-agenda-overriding-header <span style="font-style: italic;">"Active Projekter"</span>)))))

    (<span style="font-style: italic;">"n"</span> <span style="font-style: italic;">"Next Tasks"</span>
     ((todo <span style="font-style: italic;">"NEXT"</span>
        ((org-agenda-overriding-header <span style="font-style: italic;">"Next Tasks"</span>)))))

    (<span style="font-style: italic;">"W"</span> <span style="font-style: italic;">"Work Tasks"</span> tags-todo <span style="font-style: italic;">"+work-email"</span>)

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Low-effort next actions</span>
    (<span style="font-style: italic;">"e"</span> tags-todo <span style="font-style: italic;">"+TODO=\"NEXT\"+Effort&lt;15&amp;+Effort&gt;0"</span>
     ((org-agenda-overriding-header <span style="font-style: italic;">"Low Effort Tasks"</span>)
      (org-agenda-max-todos 20)
      (org-agenda-files org-agenda-files)))

    (<span style="font-style: italic;">"w"</span> <span style="font-style: italic;">"Workflow Status"</span>
     ((todo <span style="font-style: italic;">"WAIT"</span>
            ((org-agenda-overriding-header <span style="font-style: italic;">"Waiting on External"</span>)
             (org-agenda-files org-agenda-files)))
      (todo <span style="font-style: italic;">"REVIEW"</span>
            ((org-agenda-overriding-header <span style="font-style: italic;">"In Review"</span>)
             (org-agenda-files org-agenda-files)))
      (todo <span style="font-style: italic;">"PLAN"</span>
            ((org-agenda-overriding-header <span style="font-style: italic;">"In Planning"</span>)
             (org-agenda-todo-list-sublevels nil)
             (org-agenda-files org-agenda-files)))
      (todo <span style="font-style: italic;">"BACKLOG"</span>
            ((org-agenda-overriding-header <span style="font-style: italic;">"Project Backlog"</span>)
             (org-agenda-todo-list-sublevels nil)
             (org-agenda-files org-agenda-files)))
      (todo <span style="font-style: italic;">"READY"</span>
            ((org-agenda-overriding-header <span style="font-style: italic;">"Ready for Work"</span>)
             (org-agenda-files org-agenda-files)))
      (todo <span style="font-style: italic;">"ACTIVE"</span>
            ((org-agenda-overriding-header <span style="font-style: italic;">"Active Projekter"</span>)
             (org-agenda-files org-agenda-files)))
      (todo <span style="font-style: italic;">"COMPLETED"</span>
            ((org-agenda-overriding-header <span style="font-style: italic;">"Completed Projekter"</span>)
             (org-agenda-files org-agenda-files)))
      (todo <span style="font-style: italic;">"CANC"</span>
            ((org-agenda-overriding-header <span style="font-style: italic;">"Cancelled Projekter"</span>)
             (org-agenda-files org-agenda-files)))))))

  (<span style="font-weight: bold;">setq</span> org-capture-templates
    `((<span style="font-style: italic;">"t"</span> <span style="font-style: italic;">"Tasks / Projekter"</span>)
      (<span style="font-style: italic;">"tt"</span> <span style="font-style: italic;">"Task"</span> entry (file+olp <span style="font-style: italic;">"~/Projekter/Kode/OrgFiles/Opgaver.org"</span> <span style="font-style: italic;">"Inbox"</span>)
           <span style="font-style: italic;">"* TODO %?\n  %U\n  %a\n  %i"</span> <span style="font-weight: bold;">:empty-lines</span> 1)

      (<span style="font-style: italic;">"j"</span> <span style="font-style: italic;">"Journal Entries"</span>)
      (<span style="font-style: italic;">"jj"</span> <span style="font-style: italic;">"Journal"</span> entry
           (file+olp+datetree <span style="font-style: italic;">"~/Projekter/Kode/OrgFiles/Journal.org"</span>)
           <span style="font-style: italic;">"\n* %&lt;%I:%M %p&gt; - Journal :journal:\n\n%?\n\n"</span>
           <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">,(dw/read-file-as-string "~/Notes/Templates/Daily.org")</span>
           <span style="font-weight: bold;">:clock-in</span> <span style="font-weight: bold;">:clock-resume</span>
           <span style="font-weight: bold;">:empty-lines</span> 1)
      (<span style="font-style: italic;">"jm"</span> <span style="font-style: italic;">"Meeting"</span> entry
           (file+olp+datetree <span style="font-style: italic;">"~/Projekter/Kode/OrgFiles/Journal.org"</span>)
           <span style="font-style: italic;">"* %&lt;%I:%M %p&gt; - %a :meetings:\n\n%?\n\n"</span>
           <span style="font-weight: bold;">:clock-in</span> <span style="font-weight: bold;">:clock-resume</span>
           <span style="font-weight: bold;">:empty-lines</span> 1)

      (<span style="font-style: italic;">"w"</span> <span style="font-style: italic;">"Workflows"</span>)
      (<span style="font-style: italic;">"we"</span> <span style="font-style: italic;">"Checking Email"</span> entry (file+olp+datetree <span style="font-style: italic;">"~/Projekter/Kode/OrgFiles/Journal.org"</span>)
           <span style="font-style: italic;">"* Checking Email :email:\n\n%?"</span> <span style="font-weight: bold;">:clock-in</span> <span style="font-weight: bold;">:clock-resume</span> <span style="font-weight: bold;">:empty-lines</span> 1)

      (<span style="font-style: italic;">"m"</span> <span style="font-style: italic;">"Metrics Capture"</span>)
      (<span style="font-style: italic;">"mw"</span> <span style="font-style: italic;">"Weight"</span> table-line (file+headline <span style="font-style: italic;">"~/Projekter/Kode/OrgFiles/Metrics.org"</span> <span style="font-style: italic;">"Weight"</span>)
       <span style="font-style: italic;">"| %U | %^{Weight} | %^{Notes} |"</span> <span style="font-weight: bold;">:kill-buffer</span> t)))

  (define-key global-map (kbd <span style="font-style: italic;">"C-c j"</span>)
    (<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>) (org-capture nil <span style="font-style: italic;">"jj"</span>)))

  (efs/org-font-setup))
</pre>
</div>
</div>
</div>
