public/Emacs.html
<div id="outline-container-org608e72e" class="outline-2">
<h2 id="org608e72e">Org Roam - notes</h2>
<div class="outline-text-2" id="text-org608e72e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-roam
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">setq</span> org-roam-v2-ack t)
  <span style="font-weight: bold;">:custom</span>
  (org-roam-directory <span style="font-style: italic;">"~/Noter"</span>)
  (org-roam-completion-everywhere t)
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-c n l"</span> . org-roam-buffer-toggle)
         (<span style="font-style: italic;">"C-c n f"</span> . org-roam-node-find)
         (<span style="font-style: italic;">"C-c n i"</span> . org-roam-node-insert)
         <span style="font-weight: bold;">:map</span> org-mode-map
         (<span style="font-style: italic;">"C-M-i"</span> . completion-at-point)
         <span style="font-weight: bold;">:map</span> org-roam-dailies-map
         (<span style="font-style: italic;">"Y"</span> . org-roam-dailies-capture-yesterday)
         (<span style="font-style: italic;">"T"</span> . org-roam-dailies-capture-tomorrow))
  <span style="font-weight: bold;">:bind-keymap</span>
  (<span style="font-style: italic;">"C-c n d"</span> . org-roam-dailies-map)
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">org-roam-dailies</span>) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ensure the keymap is available</span>
  (org-roam-db-autosync-mode))

</pre>
</div>
</div>
</div>
<div id="outline-container-orge48223d" class="outline-2">
<h2 id="orge48223d">Structure Templates</h2>
<div class="outline-text-2" id="text-orge48223d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">with-eval-after-load</span> 'org
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">This is needed as of Org 9.2</span>
  (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">org-tempo</span>)

  (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"sh"</span> . <span style="font-style: italic;">"src shell"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"el"</span> . <span style="font-style: italic;">"src emacs-lisp"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"py"</span> . <span style="font-style: italic;">"src python"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf5fa991" class="outline-2">
<h2 id="orgf5fa991">Babel tangle this configuration</h2>
<div class="outline-text-2" id="text-orgf5fa991">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-babel-do-load-languages
  'org-babel-load-languages
  '((emacs-lisp . t)
    (python . t)))

(<span style="font-weight: bold;">setq</span> org-confirm-babel-evaluate nil)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Automatically tangle our Emacs.org config file when we save it</span>
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">efs/org-babel-tangle-config</span> ()
  (<span style="font-weight: bold;">when</span> (string-equal (file-name-directory (buffer-file-name))
                      (expand-file-name user-emacs-directory))
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Dynamic scoping to the rescue</span>
    (<span style="font-weight: bold;">let</span> ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (<span style="font-weight: bold;">lambda</span> () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))

</pre>
</div>
</div>
</div>

<div id="outline-container-org5f3cdec" class="outline-2">
<h2 id="org5f3cdec">Which Key</h2>
<div class="outline-text-2" id="text-org5f3cdec">
<p>
which-key is a useful UI panel that appears when you start pressing
any key binding in Emacs to offer you all possible completions for
the prefix. For example, if you press C-c (hold control and press
the letter c), a panel will appear at the bottom of the frame dis-
playing all of the bindings under that prefix and which command they
run. This is very useful for learning the possible key bindings in
the mode of your current buffer.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package which-key
<span style="font-weight: bold;">:defer</span> 0
<span style="font-weight: bold;">:diminish</span> which-key-mode
<span style="font-weight: bold;">:config</span>
(which-key-mode)
(<span style="font-weight: bold;">setq</span> which-key-idle-delay 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgca5765f" class="outline-2">
<h2 id="orgca5765f">Counsel &amp; Ivy</h2>
<div class="outline-text-2" id="text-orgca5765f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (use-package counsel
    <span style="font-weight: bold;">:ensure</span> t)

  (use-package ivy
    <span style="font-weight: bold;">:ensure</span> t
    <span style="font-weight: bold;">:diminish</span> (ivy-mode)
    <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-x b"</span> . ivy-switch-buffer))
    <span style="font-weight: bold;">:config</span>
    (ivy-mode 1)
    (<span style="font-weight: bold;">setq</span> ivy-use-virtual-buffers t)
    (<span style="font-weight: bold;">setq</span> ivy-display-style 'fancy)
    (<span style="font-weight: bold;">setq</span> enable-recursive-minibuffers t)
  )

  (use-package ivy-rich
  <span style="font-weight: bold;">:after</span> ivy
  <span style="font-weight: bold;">:init</span>
  (ivy-rich-mode 1))

(use-package counsel
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-M-j"</span> . 'counsel-switch-buffer)
         <span style="font-weight: bold;">:map</span> minibuffer-local-map
         (<span style="font-style: italic;">"C-r"</span> . 'counsel-minibuffer-history))
  <span style="font-weight: bold;">:custom</span>
  (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
  <span style="font-weight: bold;">:config</span>
  (counsel-mode 1))

(use-package ivy-prescient
<span style="font-weight: bold;">:after</span> counsel
<span style="font-weight: bold;">:custom</span>
(ivy-prescient-enable-filtering nil)
<span style="font-weight: bold;">:config</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Uncomment the following line to have sorting remembered across sessions!</span>
<span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">(prescient-persist-mode 1)</span>
(ivy-prescient-mode 1))

    (use-package swiper
      <span style="font-weight: bold;">:ensure</span> try
      <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-s"</span> . swiper)
             (<span style="font-style: italic;">"C-r"</span> . swiper)
             (<span style="font-style: italic;">"C-c C-r"</span> . ivy-resume)
             (<span style="font-style: italic;">"M-x"</span> . counsel-M-x)
             (<span style="font-style: italic;">"C-x C-f"</span> . counsel-find-file))
      <span style="font-weight: bold;">:config</span>
      (<span style="font-weight: bold;">progn</span>
        (ivy-mode 1)
        (<span style="font-weight: bold;">setq</span> ivy-use-virtual-buffers t)
        (<span style="font-weight: bold;">setq</span> ivy-display-style 'fancy)
        (define-key read-expression-map (kbd <span style="font-style: italic;">"C-r"</span>) 'counsel-expression-history)
        ))

  (use-package avy
    <span style="font-weight: bold;">:ensure</span> t
    <span style="font-weight: bold;">:bind</span> (<span style="font-style: italic;">"M-s"</span> . avy-goto-char))
</pre>
</div>
</div>
</div>
