content/Emacs.org
* Helm sorting and completion
#+begin_src emacs-lisp :tangle ./init.el
  (use-package vertico
  :ensure t
  :bind (:map vertico-map
         ("C-j" . vertico-next)
         ("C-k" . vertico-previous)
         ("C-f" . vertico-exit)
         :map minibuffer-local-map
         ("M-h" . backward-kill-word))
  :custom
  (vertico-cycle t)
  :init
  (vertico-mode))

;;(use-package savehist
;;  :init
;;  (savehist-mode))

(use-package marginalia
  :after vertico
  :ensure t
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init
  (marginalia-mode))
#+end_src
* Let's get encrypted
#+begin_src emacs-lisp :tangle ./init.el
  (setenv "GPG_AGENT_INFO" nil)  ;; use emacs pinentry
    (setq auth-source-debug t)

    (setq epg-gpg-program "gpg2")  ;; not necessary
    (require 'epa-file)
    (epa-file-enable)
(setq epa-pinentry-mode 'loopback)
(setq epg-pinentry-mode 'loopback)

    (require 'org-crypt)
    (org-crypt-use-before-save-magic)

(defun efs/lookup-password (&rest keys)
  (let ((result (apply #'auth-source-search keys)))
    (if result
	(funcall (plist-get (car result) :secret))
      nil)))
#+end_src

* Autocomplete
#+begin_src emacs-lisp :tangle ./init.el
    (use-package auto-complete
    :ensure t
    :init
    (progn
      (ac-config-default)
      (global-auto-complete-mode t)
      ))
  (setq ido-enable-flex-matching t)
  (setq ido-everywhere t)
  (ido-mode 1)
  (ido-yes-or-no-mode t)

  (defalias 'list-buffers 'ibuffer)

  (defalias 'list-buffers 'ibuffer-other-window)
#+end_src

* Magit
Magit is the best Git interface I’ve ever used. Common Git operations
are easy to execute quickly using Magit’s command panel system.
#+begin_src emacs-lisp :tangle ./init.el
  (use-package magit
  :commands magit-status
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

;; NOTE: Make sure to configure a GitHub token before using this package!
;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
(use-package forge
  :after magit)
#+end_src

#+RESULTS:

* Rainbow Delimiters
#+begin_src emacs-lisp :tangle ./init.el
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src
* EMMS Emacs music player
#+begin_src emacs-lisp :tangle ./init.el
  ;; EMMS basic configuration
  (use-package emms
    :demand t
    :bind
    (("<f3>" . emms)))
  (require 'emms-setup)
  (emms-all)
  (emms-default-players)
  (load "~/.dots/emacs/emms-get-lyrics")
  (setq emms-source-file-default-directory "~/Musik/") ;; Change to your music folder

    ;; Choose one of these
  (setq emms-info-functions '(emms-info-tinytag))  ;; When using Tinytag

  ;; Load cover images
  (setq emms-browser-covers 'emms-browser-cache-thumbnail-async)

  ;; Helm EMMS
  (use-package helm-emms
    :bind
    (("<C-f5>" . helm-emms)))

  (use-package ivy-emms
    :bind
    (("<C-f4>" . ivy-emms)))

    (global-set-key [f3] 'emms-get-lyrics-current-song)

#+end_src

