public/Emacs.html

<div id="outline-container-orgeb13655" class="outline-2">
<h2 id="orgeb13655">Helm sorting and completion</h2>
<div class="outline-text-2" id="text-orgeb13655">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (use-package vertico
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:bind</span> (<span style="font-weight: bold;">:map</span> vertico-map
         (<span style="font-style: italic;">"C-j"</span> . vertico-next)
         (<span style="font-style: italic;">"C-k"</span> . vertico-previous)
         (<span style="font-style: italic;">"C-f"</span> . vertico-exit)
         <span style="font-weight: bold;">:map</span> minibuffer-local-map
         (<span style="font-style: italic;">"M-h"</span> . backward-kill-word))
  <span style="font-weight: bold;">:custom</span>
  (vertico-cycle t)
  <span style="font-weight: bold;">:init</span>
  (vertico-mode))

<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(use-package savehist</span>
<span style="font-weight: bold; font-style: italic;">;;  </span><span style="font-weight: bold; font-style: italic;">:init</span>
<span style="font-weight: bold; font-style: italic;">;;  </span><span style="font-weight: bold; font-style: italic;">(savehist-mode))</span>

(use-package marginalia
  <span style="font-weight: bold;">:after</span> vertico
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:custom</span>
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  <span style="font-weight: bold;">:init</span>
  (marginalia-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfc1427e" class="outline-2">
<h2 id="orgfc1427e">Let's get encrypted</h2>
<div class="outline-text-2" id="text-orgfc1427e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (setenv <span style="font-style: italic;">"GPG_AGENT_INFO"</span> nil)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">use emacs pinentry</span>
    (<span style="font-weight: bold;">setq</span> auth-source-debug t)

    (<span style="font-weight: bold;">setq</span> epg-gpg-program <span style="font-style: italic;">"gpg2"</span>)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">not necessary</span>
    (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">epa-file</span>)
    (epa-file-enable)
(<span style="font-weight: bold;">setq</span> epa-pinentry-mode 'loopback)
(<span style="font-weight: bold;">setq</span> epg-pinentry-mode 'loopback)

    (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">org-crypt</span>)
    (org-crypt-use-before-save-magic)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">efs/lookup-password</span> (<span style="font-weight: bold; text-decoration: underline;">&amp;rest</span> keys)
  (<span style="font-weight: bold;">let</span> ((result (apply #'auth-source-search keys)))
    (<span style="font-weight: bold;">if</span> result
        (funcall (plist-get (car result) <span style="font-weight: bold;">:secret</span>))
      nil)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7d8894" class="outline-2">
<h2 id="orge7d8894">Autocomplete</h2>
<div class="outline-text-2" id="text-orge7d8894">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (use-package auto-complete
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">progn</span>
    (ac-config-default)
    (global-auto-complete-mode t)
    ))
(<span style="font-weight: bold;">setq</span> ido-enable-flex-matching t)
(<span style="font-weight: bold;">setq</span> ido-everywhere t)
(ido-mode 1)
(ido-yes-or-no-mode t)

(<span style="font-weight: bold;">defalias</span> '<span style="font-weight: bold;">list-buffers</span> 'ibuffer)

(<span style="font-weight: bold;">defalias</span> '<span style="font-weight: bold;">list-buffers</span> 'ibuffer-other-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-org850ac84" class="outline-2">
<h2 id="org850ac84">Magit</h2>
<div class="outline-text-2" id="text-org850ac84">
<p>
Magit is the best Git interface I’ve ever used. Common Git operations
are easy to execute quickly using Magit’s command panel system.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (use-package magit
  <span style="font-weight: bold;">:commands</span> magit-status
  <span style="font-weight: bold;">:custom</span>
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">NOTE: Make sure to configure a GitHub token before using this package!</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">- https://magit.vc/manual/forge/Token-Creation.html#Token-Creation</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">- https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started</span>
(use-package forge
  <span style="font-weight: bold;">:after</span> magit)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4dbb338" class="outline-2">
<h2 id="org4dbb338">Rainbow Delimiters</h2>
<div class="outline-text-2" id="text-org4dbb338">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package rainbow-delimiters
  <span style="font-weight: bold;">:hook</span> (prog-mode . rainbow-delimiters-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org378469e" class="outline-2">
<h2 id="org378469e">EMMS Emacs music player</h2>
<div class="outline-text-2" id="text-org378469e">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">EMMS basic configuration</span>
(use-package emms
  <span style="font-weight: bold;">:demand</span> t
  <span style="font-weight: bold;">:bind</span>
  ((<span style="font-style: italic;">"&lt;f3&gt;"</span> . emms)))
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">emms-setup</span>)
(emms-all)
(emms-default-players)
(load <span style="font-style: italic;">"~/.dots/emacs/emms-get-lyrics"</span>)
(<span style="font-weight: bold;">setq</span> emms-source-file-default-directory <span style="font-style: italic;">"~/Musik/"</span>) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Change to your music folder</span>

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Choose one of these</span>
(<span style="font-weight: bold;">setq</span> emms-info-functions '(emms-info-tinytag))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">When using Tinytag</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Load cover images</span>
(<span style="font-weight: bold;">setq</span> emms-browser-covers 'emms-browser-cache-thumbnail-async)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Helm EMMS</span>
(use-package helm-emms
  <span style="font-weight: bold;">:bind</span>
  ((<span style="font-style: italic;">"&lt;C-f5&gt;"</span> . helm-emms)))

(use-package ivy-emms
  <span style="font-weight: bold;">:bind</span>
  ((<span style="font-style: italic;">"&lt;C-f4&gt;"</span> . ivy-emms)))

  (global-set-key [f3] 'emms-get-lyrics-current-song)

</pre>
</div>
</div>
</div>
