content/Emacs.org
* Erc Chat

#+BEGIN_SRC emacs-lisp
(setq erc-server "irc.libera.chat"
      erc-nick "ravenkiller1709"
      erc-user-full-name "Kim Kruse"
      erc-track-shorten-start 8
      erc-autojoin-channels-alist '(("irc.libera.chat" "#systemcrafters" "#emacs"))
      erc-kill-buffer-on-part t
      erc-auto-query 'bury)

(setq erc-fill-column 120
      erc-fill-function 'erc-fill-static
      erc-fill-static-center 20)

(setq erc-track-exclude-types '("JOIN" "NICK" "PART" "QUIT" "MODE" "AWAY")
      erc-hide-list '("JOIN" "NICK" "PART" "QUIT" "MODE" "AWAY"))
      ;; erc-track-exclude-server-buffer t)

(setq erc-track-visibility nil) ; Only use the selected frame for visibility
#+END_SRC
* App launcher
#+begin_src emacs-lisp :tangle ./init.el
  (use-package dmenu
    :ensure t
    :bind
    ("s-SPC" . 'dmenu))
#+end_src
* Loading libraries
loading mail settings
#+begin_src emacs-lisp :tangle ./init.el
  (load "~/.dots/emacs/mail.el")
  (require 'mu4e)
#+end_src

* Reveal.js
Enabling presentation mode
#+begin_src emacs-lisp
  (use-package ox-reveal
  :ensure ox-reveal)

  (setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js")
  (setq org-reveal-mathjax t)
#+end_src


