public/Emacs.html

<div id="outline-container-orga779402" class="outline-2">
<h2 id="orga779402">Erc Chat</h2>
<div class="outline-text-2" id="text-orga779402">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> erc-server <span style="font-style: italic;">"irc.libera.chat"</span>
      erc-nick <span style="font-style: italic;">"ravenkiller1709"</span>
      erc-user-full-name <span style="font-style: italic;">"Kim Kruse"</span>
      erc-track-shorten-start 8
      erc-autojoin-channels-alist '((<span style="font-style: italic;">"irc.libera.chat"</span> <span style="font-style: italic;">"#systemcrafters"</span> <span style="font-style: italic;">"#emacs"</span>))
      erc-kill-buffer-on-part t
      erc-auto-query 'bury)

(<span style="font-weight: bold;">setq</span> erc-fill-column 120
      erc-fill-function 'erc-fill-static
      erc-fill-static-center 20)

(<span style="font-weight: bold;">setq</span> erc-track-exclude-types '(<span style="font-style: italic;">"JOIN"</span> <span style="font-style: italic;">"NICK"</span> <span style="font-style: italic;">"PART"</span> <span style="font-style: italic;">"QUIT"</span> <span style="font-style: italic;">"MODE"</span> <span style="font-style: italic;">"AWAY"</span>)
      erc-hide-list '(<span style="font-style: italic;">"JOIN"</span> <span style="font-style: italic;">"NICK"</span> <span style="font-style: italic;">"PART"</span> <span style="font-style: italic;">"QUIT"</span> <span style="font-style: italic;">"MODE"</span> <span style="font-style: italic;">"AWAY"</span>))
      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">erc-track-exclude-server-buffer t)</span>

(<span style="font-weight: bold;">setq</span> erc-track-visibility nil) <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Only use the selected frame for visibility</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6d75909" class="outline-2">
<h2 id="org6d75909">App launcher</h2>
<div class="outline-text-2" id="text-org6d75909">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package dmenu
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:bind</span>
  (<span style="font-style: italic;">"s-SPC"</span> . 'dmenu))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb239536" class="outline-2">
<h2 id="orgb239536">Loading libraries</h2>
<div class="outline-text-2" id="text-orgb239536">
<p>
loading mail settings
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(load <span style="font-style: italic;">"~/.dots/emacs/mail.el"</span>)
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">mu4e</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org70ab9c5" class="outline-2">
<h2 id="org70ab9c5">Reveal.js</h2>
<div class="outline-text-2" id="text-org70ab9c5">
<p>
Enabling presentation mode
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ox-reveal
<span style="font-weight: bold;">:ensure</span> ox-reveal)

(<span style="font-weight: bold;">setq</span> org-reveal-root <span style="font-style: italic;">"https://cdn.jsdelivr.net/npm/reveal.js"</span>)
(<span style="font-weight: bold;">setq</span> org-reveal-mathjax t)
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
