content/init.el

(use-package dmenu
  :ensure t
  :bind
  ("s-SPC" . 'dmenu))

(load "~/.dots/emacs/mail.el")
(require 'mu4e)
